Hi @mikequentel,

A could quick questions:
- Which version of vSphere is in use in the environemnt?
- Can you see if this  is reproducible with the [latest](https://github.com/hashicorp/terraform-provider-vsphere/releases/latest) version of the provider?
- Can you share the specific list of privileges you've assigned to the role for repoduction?

I tested with the following this afternoon and it does not return the error unless I select non-default  `vmDirectory` or `hostLocal`.

- Terraform v1.1.7
- Terraform Provider for VMware vSphere v2.1.1
- VMware vSphere 7.0.3(c)

```hcl
resource "vsphere_virtual_machine" "vm" {
  # ... other configuration ....
  swap_placement_policy   = "inherit"
  # ... the above is the default, but setting explicitly....
}
```

My user, `terraform@rainpole.io`, does not have the Change Swap Placement (`VirtualMachine.Config.SwapPlacement`) privilege enabled. 

- On the first apply, It deploys with the default `inherit` w/o issue. 
- The second and third apply try the non-defaults and return the expected error.
- On the fourth apply its set back to the default and completed with no changes.

```console
❯ terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vsphere_virtual_machine.vm will be created
  + resource "vsphere_virtual_machine" "vm" {
      + annotation                              = (known after apply)
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_id                            = "datastore-11"
      + default_ip_address                      = (known after apply)
      + efi_secure_boot_enabled                 = true
      + ept_rvi_mode                            = "automatic"
      + firmware                                = "efi"
      + folder                                  = "workloads"
      + force_power_off                         = true
      + guest_id                                = "centos8_64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 4096
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "centos-test"
      + num_cores_per_socket                    = 1
      + num_cpus                                = 2
      + power_state                             = (known after apply)
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-6046"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + tools_upgrade_policy                    = "manual"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5

      + clone {
          + template_uuid = "42023ec5-63c7-8821-2ec9-a07c734718ba"
          + timeout       = 30

          + customize {
              + dns_server_list = [
                  + "172.16.11.11",
                  + "172.16.11.12",
                ]
              + dns_suffix_list = [
                  + "rainpole.io",
                ]
              + ipv4_gateway    = "172.16.11.1"
              + timeout         = 10

              + linux_options {
                  + domain       = "rainpole.io"
                  + host_name    = "centos-test"
                  + hw_clock_utc = true
                  + script_text  = <<-EOT
                        #!/bin/sh
                        if [ x$1=x"precustomization" ];
                        then
                          mkdir -p /i-am/precustomization
                        fi
                        if [ x$1=x"postcustomization" ];
                        then
                          mkdir -p /i-am/postcustomization
                        fi
                    EOT
                }

              + network_interface {
                  + ipv4_address = "172.16.11.111"
                  + ipv4_netmask = 24
                }
            }
        }

      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk0"
          + path              = (known after apply)
          + size              = 40
          + storage_policy_id = (known after apply)
          + thin_provisioned  = false
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-1001"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
vsphere_virtual_machine.vm: Creating...
vsphere_virtual_machine.vm: Still creating... [10s elapsed]
vsphere_virtual_machine.vm: Still creating... [20s elapsed]
vsphere_virtual_machine.vm: Still creating... [30s elapsed]
vsphere_virtual_machine.vm: Still creating... [40s elapsed]
vsphere_virtual_machine.vm: Still creating... [50s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m0s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m10s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m20s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m30s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m40s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m50s elapsed]
vsphere_virtual_machine.vm: Still creating... [2m0s elapsed]
vsphere_virtual_machine.vm: Still creating... [2m10s elapsed]
vsphere_virtual_machine.vm: Still creating... [2m20s elapsed]
vsphere_virtual_machine.vm: Still creating... [2m30s elapsed]
vsphere_virtual_machine.vm: Still creating... [2m40s elapsed]
vsphere_virtual_machine.vm: Creation complete after 2m47s [id=42020036-a94c-6328-25ae-42b34253ff07]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
❯ terraform apply -auto-approve
vsphere_virtual_machine.vm: Refreshing state... [id=42020036-a94c-6328-25ae-42b34253ff07]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # vsphere_virtual_machine.vm has changed
  ~ resource "vsphere_virtual_machine" "vm" {
      + custom_attributes                       = {}
      + extra_config                            = {}
        id                                      = "42020036-a94c-6328-25ae-42b34253ff07"
        name                                    = "centos-test"
      + pci_device_id                           = []
      + tags                                    = []
        # (66 unchanged attributes hidden)

      ~ clone {
          + ovf_network_map = {}
          + ovf_storage_map = {}
            # (3 unchanged attributes hidden)

          ~ customize {
                # (4 unchanged attributes hidden)


              ~ network_interface {
                  + dns_server_list = []
                    # (3 unchanged attributes hidden)
                }
                # (1 unchanged block hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using
ignore_changes, the following plan may include actions to undo or respond to these changes.

───────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # vsphere_virtual_machine.vm will be updated in-place
  ~ resource "vsphere_virtual_machine" "vm" {
        id                                      = "42020036-a94c-6328-25ae-42b34253ff07"
        name                                    = "centos-test"
      ~ swap_placement_policy                   = "inherit" -> "hostLocal"
        tags                                    = []
        # (68 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
vsphere_virtual_machine.vm: Modifying... [id=42020036-a94c-6328-25ae-42b34253ff07]
╷
│ Error: ServerFaultCode: Permission to perform this operation was denied.
│ 
│   with vsphere_virtual_machine.vm,
│   on main.tf line 37, in resource "vsphere_virtual_machine" "vm":
│   37: resource "vsphere_virtual_machine" "vm" {
│ 
╵
❯ terraform apply -auto-approve
vsphere_virtual_machine.vm: Refreshing state... [id=42020036-a94c-6328-25ae-42b34253ff07]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # vsphere_virtual_machine.vm has changed
  ~ resource "vsphere_virtual_machine" "vm" {
      ~ guest_ip_addresses                      = [
          - "172.16.11.111",
          - "fe80::250:56ff:fe82:eef9",
        ]
        id                                      = "42020036-a94c-6328-25ae-42b34253ff07"
        name                                    = "centos-test"
      ~ power_state                             = "on" -> "off"
        tags                                    = []
      ~ vmware_tools_status                     = "guestToolsRunning" -> "guestToolsNotRunning"
        # (66 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using
ignore_changes, the following plan may include actions to undo or respond to these changes.

───────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # vsphere_virtual_machine.vm will be updated in-place
  ~ resource "vsphere_virtual_machine" "vm" {
        id                                      = "42020036-a94c-6328-25ae-42b34253ff07"
        name                                    = "centos-test"
      ~ swap_placement_policy                   = "inherit" -> "vmDirectory"
        tags                                    = []
        # (68 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
vsphere_virtual_machine.vm: Modifying... [id=42020036-a94c-6328-25ae-42b34253ff07]
╷
│ Error: ServerFaultCode: Permission to perform this operation was denied.
│ 
│   with vsphere_virtual_machine.vm,
│   on main.tf line 37, in resource "vsphere_virtual_machine" "vm":
│   37: resource "vsphere_virtual_machine" "vm" {
│ 
╵
❯ terraform apply -auto-approve
vsphere_virtual_machine.vm: Refreshing state... [id=42020036-a94c-6328-25ae-42b34253ff07]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so
no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```

**Ryan Johnson**
Staff II Solutions Architect | VMware, Inc.
[credly.com/users/tenthirtyam](https://github.com/hashicorp/terraform-provider-vsphere/issues/credly.com/users/tenthirtyam)